app/controllers/questions_controller.rb

  def index
    @questions = Question.all.order(vote_count: :desc)
---
SELECT "questions".* FROM "questions"   ORDER BY "questions"."vote_count" DESC

  def show
    @question = Question.find(params[:id])
    @answers = @question.answers.order(vote_count: :desc)
---
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "answers".* FROM "answers"  WHERE "answers"."question_id" = $1  ORDER BY "answers"."vote_count" DESC  [["question_id", 5]]
SELECT SUM("vote_answers"."vote_count") AS sum_id FROM "vote_answers"  WHERE "vote_answers"."answer_id" = $1  [["answer_id", 1]]
SELECT SUM("vote_questions"."vote_count") AS sum_id FROM "vote_questions"  WHERE "vote_questions"."question_id" = $1  [["question_id", 1]]

  def create
    @new_question = Question.new(question_params)
    if @new_question.save
---
INSERT INTO "questions" ("content", "created_at", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "How can I use rspec on rails?"], ["created_at", "2015-04-08 01:54:59.248519"], ["title", "rails rspec"], ["updated_at", "2015-04-08 01:54:59.248519"]]

  def destroy
    @question = Question.find(params[:id])
    @question.destroy
---
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 1]]

  def update
    @question = Question.find(params[:id])
    @question.update(question_params)
---
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "questions" SET "content" = $1, "updated_at" = $2 WHERE "questions"."id" = 2  [["content", "yesadfsdafs"], ["updated_at", "2015-04-13 05:25:51.522386"]]

  def upvote
    @question = Question.find(params[:id])
    @question.vote_count += 1

    @question.save
---
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "questions" SET "updated_at" = $1, "vote_count" = $2 WHERE "questions"."id" = 3  [["updated_at", "2015-04-08 03:17:14.195996"], ["vote_count", 1]]

  def downvote
    @question = Question.find(params[:id])
    @question.vote_count -= 1

    @question.save
---
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 4]]
UPDATE "questions" SET "updated_at" = $1, "vote_count" = $2 WHERE "questions"."id" = 4  [["updated_at", "2015-04-08 03:31:32.224552"], ["vote_count", 4]]